app/services/create_user.rb

INSERT INTO `users` (`email`, `encrypted_password`, `confirmation_token`, `confirmation_sent_at`, `created_at`, `updated_at`) VALUES ('srontobisnis@gmail.com', '$2a$11$zPuRt8G0p3gGz1LA2C7JYOht1Csrl/YQKIrDOmAFC1uTplKYWJf/K', 'yAdR4NbaHm6ZTGxSC5aZ', '2019-03-19 12:20:27', '2019-03-19 12:20:27', '2019-03-19 12:20:27')
---
  def call
    return user unless user.save