lib/custom_token_response.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def body
    user_details = User.find(@token.resource_owner_id)