app/controllers/api/v1/categories_controller.rb

INSERT INTO `categories` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('tshirt', 'tshirt', '2019-04-13 09:16:49', '2019-04-13 09:16:49')
---
  def create
    category = Category.new(create_category_params)
    category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`deleted` = FALSE ORDER BY `categories`.`id` DESC
---
  def index
    @categories = Category.where(deleted: false).order(id: :desc)

UPDATE `categories` SET `name` = 'xfgdfg asda', `updated_at` = '2019-04-14 03:55:15' WHERE `categories`.`id` = 2
---
  def update
    @category.update(update_category_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
---
  def specified_category
    @category = Category.find(params[:id])