app/controllers/api/v1/chooses_controller.rb

  def update
    choose = true
    get_goods
    good = @goods.where(product_id: params[:id])
    if good.length > 0
      good.delete_all
---
DELETE FROM `products` WHERE `products`.`id` = 7