app/controllers/api/v1/omniauth_callbacks_controller.rb

INSERT INTO `oauth_access_tokens` (`resource_owner_id`, `token`, `expires_in`, `created_at`, `scopes`) VALUES (1, '20b4dede754b258c10ed1e11ecbbcda4317c4f7018114abc5f43761936088325', 7200, '2019-04-05 09:25:38', 'public')
---
  def all
    p request.env["omniauth.auth"]
    user = User.from_omniauth(request.env["omniauth.auth"], current_user)
    if user.persisted?
      sign_in(user)
      create_token = Doorkeeper::AccessToken.create!(
        application_id: nil,
        resource_owner_id: user.id,
        expires_in: 2.hours,
        scopes: 'public'
      )