app/controllers/api/v1/products_controller.rb

  def create
    product = Product.new(create_product_params)
    product.save
---
INSERT INTO `products` (`name`, `description`, `price`, `margin_per_sale`, `profit_per_visitor`, `shipping_details`, `shipping_charges`, `sizes`, `colour`, `user_id`, `category_id`, `quantity`, `created_at`, `updated_at`) VALUES ('12312', 'asda', 123.0, 4, 5, 3, 23.0, 's', 'purple', 1, 2, 34, '2019-05-20 03:35:49', '2019-05-20 03:35:49')

  def index
    @products = current_resource_owner.products.where(deleted: false).order(id: :desc)
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted` = FALSE ORDER BY `products`.`id` DESC

  def global
    @products = Product.where(deleted: false).order(id: :desc)
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted` = FALSE ORDER BY `products`.`id` DESC

  def update
    @product.update(update_product_params)
---
UPDATE `products` SET `deleted` = TRUE, `updated_at` = '2019-05-20 09:00:20' WHERE `products`.`id` = 1

  def destroy
    @product.update(deleted: true)
---
UPDATE `products` SET `deleted` = TRUE, `updated_at` = '2019-05-20 09:24:18' WHERE `products`.`id` = 2

  def specified_product
    @product = current_resource_owner.products.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1