app/controllers/api/v1/webpages_controller.rb

  def create
    webpage = current_resource_owner.webpage
    if webpage
      webpage.update update_webpage_params
    else
      webpage = Webpage.new(create_webpage_params)
      webpage.save
---
UPDATE `webpages` SET `cover_file_name` = '1964-20150901-RonaldMcTrump.png', `cover_content_type` = 'image/png', `cover_file_size` = 319551, `cover_updated_at` = '2019-05-24 04:26:09', `description` = 'asdasdas', `logo_file_name` = '60651807_148225799564120_8665358426746351086_n.jpg', `logo_content_type` = 'image/jpeg', `logo_file_size` = 167491, `logo_updated_at` = '2019-05-24 04:26:12', `updated_at` = '2019-05-24 04:26:13' WHERE `webpages`.`id` = 1
INSERT INTO `webpages` (`ig_handle`, `page_name`, `description`, `video_link`, `user_id`, `created_at`, `updated_at`) VALUES ('[object HTMLInputElement]', 'undefined', '[object HTMLTextAreaElement]', '[object HTMLInputElement]', 2, '2019-05-23 15:20:16', '2019-05-23 15:20:16')