app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def current_resource_owner
    User.find(doorkeeper_token.resource_owner_id) if doorkeeper_token