app/models/user.rb

  def self.from_omniauth(auth, current_user)
    authorization = Authorization.where(:provider => auth.provider, :uid => auth.uid.to_s, :token => auth.credentials.token, :secret => auth.credentials.secret).first_or_initialize
    if authorization.user.blank?
      user = current_user || User.where('email = ?', auth["info"]["email"]).first
      if user.blank?
       user = User.new
       user.password = Devise.friendly_token[0,10]
       user.name = auth.info.name
       user.email = auth.info.email
       if auth.provider == "twitter"
         user.save(:validate => false)
       else
         user.save
---
SELECT  `authorizations`.* FROM `authorizations` WHERE `authorizations`.`provider` = 'instagram' AND `authorizations`.`uid` = '1148671336' AND `authorizations`.`token` = '1148671336.3407ac8.2635e021d23d414f9c08b2b4a4ec0feb' AND `authorizations`.`secret` IS NULL ORDER BY `authorizations`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE (email = NULL) ORDER BY `users`.`id` ASC LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'srontobisnis@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES ('Al Fa Do', '2019-04-05 02:18:45', '2019-04-05 02:18:45', 'srontobisnis@gmail.com', '$2a$11$xdx3ReQx.TGqzP/MjPP0TeaJFUAWZaJNGHUz316nc3rWvs/W12Dru')
INSERT INTO `authorizations` (`provider`, `uid`, `user_id`, `token`, `created_at`, `updated_at`) VALUES ('facebook', '10219232143824214', 1, 'EAAEjbDe9xNQBAAzMJiGLrSKXDTanU0oC3Fl5x47qsYq7zWP8ath0KWZAeC0YscSL0p7eQ9RlyJSNI6HVo34tICr9pnJT9nqzwJh0KkSyN4kD5ZBr2iZBkST6HV6ZANQj6gfvv2WHRbrZAe3UZAFePEbWXcKxxtC8UZD', '2019-04-05 09:19:28', '2019-04-05 09:19:28')
INSERT INTO `authorizations` (`provider`, `uid`, `user_id`, `token`, `created_at`, `updated_at`) VALUES ('facebook', '10219232143824214', 2, 'EAAEjbDe9xNQBAECWn7ZCcNiW7xHELYTx8A7YlaZAEJgElE61yTDZAUJTwfVnKizugKdSM1v2LaCpZCB0ZBZAW4S9L7Yx7XVkP1uyMfno7ZClyDJscfGRZCHqgm1Xghz6dEhqjqZBlvWbvPP4tnYCF17t7yZB4pbxca6neJTuu2BNefYwZDZD', '2019-05-26 04:25:19', '2019-05-26 04:25:19')